---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralF
source: html/62ae95a2-2f1f-7541-75f9-7637f46baebd.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralF

Defines parameters for Flat Bar.

## Syntax (C#)
```csharp
public class StructuralSectionGeneralF : StructuralSectionRectangular
```